<a href="https://colab.research.google.com/github/vivekvision/SQLiteBasics/blob/main/SQLite_SQL_Query.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [48]:
# First load an sql extension into our environment
# This extension allows sql on Colab
#
%load_ext sql

# connect to in memory sqlite database
# This database will cease to exist as soon as the database connection is closed
%sql sqlite://

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

'Connected: @None'

Read data from a CSV file

In [61]:
import pandas as pd
EmployeeSalary = pd.read_csv("./EmployeeSalary.csv", index_col=0)

In [63]:
# Store data-frame in a SQL table of in memory sqlite database
%sql DROP TABLE if EXISTS EmployeeSalary;
%sql PERSIST EmployeeSalary;

 * sqlite://
Done.
 * sqlite://

'Persisted employeesalary'

In [64]:
%%sql

SELECT * FROM EmployeeSalary LIMIT 5;

 * sqlite://
Done.

[('i002', 'Jase', 'Erni', 'Male', 'Accounting'),
 ('i003', 'Marshall', 'Michal', 'Male', 'Accounting'),
 ('i004', 'Currie', 'Bertenshaw', 'Male', 'Accounting'),
 ('i006', 'Cull', 'Gilhoolie', 'Male', 'Accounting'),
 ('i008', 'Gavan', 'Brewin', 'Male', 'Accounting')]

Select a single column

In [65]:
%%sql

SELECT EmployeeID FROM EmployeeSalary LIMIT 5;

 * sqlite://
Done.

[('i001',), ('i002',), ('i003',), ('i004',), ('i005',)]

Select based on where condition

In [66]:
%%sql

SELECT * FROM EmployeeSalary WHERE Gender = 'Male' AND Department = 'Accounting'

 * sqlite://
Done.

[('i002', 'Jase', 'Erni', 'Male', 'Accounting'),
 ('i003', 'Marshall', 'Michal', 'Male', 'Accounting'),
 ('i004', 'Currie', 'Bertenshaw', 'Male', 'Accounting'),
 ('i006', 'Cull', 'Gilhoolie', 'Male', 'Accounting'),
 ('i008', 'Gavan', 'Brewin', 'Male', 'Accounting'),
 ('i010', 'Berkeley', 'Simonson', 'Male', 'Accounting'),
 ('i011', 'Nikolaos', 'Goad', 'Male', 'Accounting'),
 ('i013', 'Ode', 'Pawlowicz', 'Male', 'Accounting')]

Order by

In [69]:
%%sql

SELECT * FROM EmployeeSalary ORDER BY EmployeeID DESC LIMIT 5;

 * sqlite://
Done.

[('i172', 'Abigale', 'Lascell', 'Female', 'Support'),
 ('i171', 'Ameline', 'Iacovo', 'Female', 'Support'),
 ('i170', 'Camellia', 'Glyne', 'Female', 'Support'),
 ('i169', 'Melisse', 'Rivlin', 'Female', 'Support'),
 ('i168', 'Carleen', 'Sweeten', 'Female', 'Support')]

Distinct

In [71]:
%%sql

SELECT DISTINCT Department FROM EmployeeSalary

 * sqlite://
Done.

[('Accounting',),
 ('Engineering',),
 ('Human Resources',),
 ('Operations',),
 ('Project Management',),
 ('Sales Managers',),
 ('Support',)]

Count

In [72]:
%%sql

SELECT COUNT(Department) FROM EmployeeSalary

 * sqlite://
Done.

[(172,)]

Create a table

In [74]:
%%sql 
CREATE TABLE IF NOT EXISTS EmployeeTable1(EmployeeID INT, 
                                         FirstName VARCHAR(25), 
                                         LastName VARCHAR(25), 
                                         Gender VARCHAR(10),
                                         Department VARCHAR(10));

 * sqlite://
Done.

[]

In [76]:
%%sql

SELECT * FROM EmployeeTable1

 * sqlite://
Done.

[]

Altering SQL Table

In [77]:
%%sql

ALTER TABLE EmployeeTable1 ADD Address VARCHAR(250)

 * sqlite://
Done.

[]

In [78]:
%%sql

SELECT * FROM EmployeeTable1

 * sqlite://
Done.

[]